package christmas.constant;

public final class CommentConstants {
    public static final String EVENT_INFORMATION_MESSAGE = """
            우테코 식당의 최대 이벤트! 12월 이벤트를 시작합니다!
            최대 3번의 중복 할인과 우테코가 준비한 두 개의 깜짝 선물을 받아 가세요!
            * 모든 이벤트는 타 이벤트와 중복 적용이 가능합니다.
            
            크리스마스 디데이를 같이 세어보아요.
            최대 3400원 할인! 1일 1000원으로 시작하여 25일까지 100원씩 증가하는 할인!
            크리스마스의 선물을 느껴보세요!
            * 25일까지
            
            지나가는 2023년을 위한, 2,023원 할인 이벤트!
            금요일, 토요일에는 메인 메뉴 1개당 2,023원을 할인합니다!
            다른 날 방문해도 섭섭해하지 마세요.
            일요일부터 목요일까지는 달콤한 디저트를 1개당 2,023원의 혜택을 받아보세요.
            
            별이 뜨는 날에는 행운이 찾아올 거야
            달력에 별이 뜬 날에는 1,000원의 추가할인이 제공됩니다!
            
            특별한 날을 더 특별하게, 샴페인과 함께하는 우아한 시간
            총 주문 금액 12만 원 이상 시 샴페인을 제공해 드립니다.
            * 할인 전 금액 기준
            
            1석 2조, 혜택도 받고, 새해선물도 받자!
            혜택 금액에 따라 받는 이벤트 배지로 1월 새해 선물 받아 가세요! 선물은 새해이벤트에 공개될 예정입니다.
            * 5천 원 이상 : 별, 1만 원 이상 : 트리, 2만 원 이상 : 산타
            
            * 총 주문 금액 10,000원 이상부터 이벤트가 적용됩니다.
            * 음료만 주문 시, 주문할 수 없습니다.
            * 메뉴는 한 번에 최대 20개까지만 주문할 수 있습니다.
            
            ------------------------ 우테코 식당 메뉴 ------------------------
            
            <애피타이저>
            양송이수프(6,000), 타파스(5,500), 시저샐러드(8,000)
            
            <메인>
            티본스테이크(55,000), 바비큐립(54,000), 해산물파스타(35,000), 크리스마스파스타(25,000)
            
            <디저트>
            초코케이크(15,000), 아이스크림(5,000)
            
            <음료>
            제로콜라(3,000), 레드와인(60,000), 샴페인(25,000)
            
            ---------------------------------------------------------------       
            안녕하세요! 우테코 식당 12월 이벤트 플래너입니다.
            """;

    private CommentConstants() {
    }
}